In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost

In [ ]:
%%sql
Create database Computer

In [3]:
%%sql
use computer

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [ ]:
%%sql
create table Manufacturers (
  Code int,
  Name varchar(100) NOT NULL,
  Primary Key (code)   
);

In [ ]:
%%sql
Insert into Manufacturers(code, name) 
values(1, "Sony"),
(2,"Creative Labs"),
(3,"Hawlwrr-Packard"),
(4,"Ioega"),
(5,"Fujitisu"),
(6,"Winchester")

In [ ]:
%%sql
update manufacturers
set name = "Iomega"
where code = 4;

In [15]:
%%sql
Create table Products( 
product_code int,
name varchar(100) not null,
price decimal(10,2) not null,
manufacturer_code int,
primary key(product_code),
foreign key (manufacturer_code) references manufacturers (code)
)

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql
Insert into Products(product_code, name, price, manufacturer_code)
Values(1,"Hard Drive", 240, 5),
(2, "Memory",120,6),
(3,'ZIP drive',150,4),
(4,'Floppy disk',5,6),
(5,'Monitor',240,1),
(6,'DVD drive',180,2),
(7,'CD drive',90,2),
(8,'Printer',270,3),
(9,'Toner cartridge',66,3),
(10,'DVD burner',180,2);

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[]

In [6]:
%%sql
Select count(*)
from manufacturers;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(6,)]

In [7]:
%%sql
select count(*)
from products

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(10,)]

In [8]:
%%sql

#1) Select the names of all the products in the store.
Select *
from products;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(1, 'Hard Drive', Decimal('240.00'), 5),
 (2, 'Memory', Decimal('120.00'), 6),
 (3, 'ZIP drive', Decimal('150.00'), 4),
 (4, 'Floppy disk', Decimal('5.00'), 6),
 (5, 'Monitor', Decimal('240.00'), 1),
 (6, 'DVD drive', Decimal('180.00'), 2),
 (7, 'CD drive', Decimal('90.00'), 2),
 (8, 'Printer', Decimal('270.00'), 3),
 (9, 'Toner cartridge', Decimal('66.00'), 3),
 (10, 'DVD burner', Decimal('180.00'), 2)]

In [9]:
%%sql

#2) Select the names and the prices of all the products in the store.

Select name, price
from products;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Hard Drive', Decimal('240.00')),
 ('Memory', Decimal('120.00')),
 ('ZIP drive', Decimal('150.00')),
 ('Floppy disk', Decimal('5.00')),
 ('Monitor', Decimal('240.00')),
 ('DVD drive', Decimal('180.00')),
 ('CD drive', Decimal('90.00')),
 ('Printer', Decimal('270.00')),
 ('Toner cartridge', Decimal('66.00')),
 ('DVD burner', Decimal('180.00'))]

In [12]:
%%sql

#3) Select the name of the products with a price less than or equal to $200.

Select name, price
from products
where price <= 200;

 * mysql+mysqlconnector://root:***@localhost
7 rows affected.

[('Memory', Decimal('120.00')),
 ('ZIP drive', Decimal('150.00')),
 ('Floppy disk', Decimal('5.00')),
 ('DVD drive', Decimal('180.00')),
 ('CD drive', Decimal('90.00')),
 ('Toner cartridge', Decimal('66.00')),
 ('DVD burner', Decimal('180.00'))]

In [13]:
%%sql

#4) Select all the products with a price between $60 and $120.

Select name, price 
from products
where price between 60 and 120;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Memory', Decimal('120.00')),
 ('CD drive', Decimal('90.00')),
 ('Toner cartridge', Decimal('66.00'))]

In [17]:
%%sql

/*
5) Select the name and
price in cents (i.e., the price must be multiplied by 100).
*/

Select name as "Name", price * 100 as "Price (in cents)" 
from  products

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Hard Drive', Decimal('24000.00')),
 ('Memory', Decimal('12000.00')),
 ('ZIP drive', Decimal('15000.00')),
 ('Floppy disk', Decimal('500.00')),
 ('Monitor', Decimal('24000.00')),
 ('DVD drive', Decimal('18000.00')),
 ('CD drive', Decimal('9000.00')),
 ('Printer', Decimal('27000.00')),
 ('Toner cartridge', Decimal('6600.00')),
 ('DVD burner', Decimal('18000.00'))]

In [21]:
%%sql


#6) Compute the average price of all the products.

Select name, avg(price) as "Price_Avg"
from products
group by name

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Hard Drive', Decimal('240.000000')),
 ('Memory', Decimal('120.000000')),
 ('ZIP drive', Decimal('150.000000')),
 ('Floppy disk', Decimal('5.000000')),
 ('Monitor', Decimal('240.000000')),
 ('DVD drive', Decimal('180.000000')),
 ('CD drive', Decimal('90.000000')),
 ('Printer', Decimal('270.000000')),
 ('Toner cartridge', Decimal('66.000000')),
 ('DVD burner', Decimal('180.000000'))]

In [22]:
%%sql

/*
7) Compute the average price of all products with manufacturer 
code equal to 2.
*/
Select name, avg(price) as "Price_Avg"
from products
where manufacturer_code = 2
group by name;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('DVD drive', Decimal('180.000000')),
 ('CD drive', Decimal('90.000000')),
 ('DVD burner', Decimal('180.000000'))]

In [90]:
%%sql

#8) Compute the number of products with a price larger than or equal to $180.

Select count(*)
from products where price >= 180;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(5,)]

In [91]:
%%sql

/*
9) Select the name and price of all products with a price larger than or equal 
to $180, and sort first by price (in descending order), and then by 
name (in ascending order).
*/
Select name, price
from products
where price >= 180
order by price desc, name asc

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Laser Printer', Decimal('270.00')),
 ('Hard Drive', Decimal('240.00')),
 ('Monitor', Decimal('240.00')),
 ('DVD burner', Decimal('180.00')),
 ('DVD drive', Decimal('180.00'))]

In [35]:
%%sql

/*
10) Select all the data from the products, including all the data for 
each product's manufacturer.
*/
Select p.*, 
m.*
from products as p
join Manufacturers as m
on p.manufacturer_code = m.code

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(5, 'Monitor', Decimal('240.00'), 1, 1, 'Sony'),
 (6, 'DVD drive', Decimal('180.00'), 2, 2, 'Creative Labs'),
 (7, 'CD drive', Decimal('90.00'), 2, 2, 'Creative Labs'),
 (10, 'DVD burner', Decimal('180.00'), 2, 2, 'Creative Labs'),
 (8, 'Printer', Decimal('270.00'), 3, 3, 'Hawlwrr-Packard'),
 (9, 'Toner cartridge', Decimal('66.00'), 3, 3, 'Hawlwrr-Packard'),
 (3, 'ZIP drive', Decimal('150.00'), 4, 4, 'Iomega'),
 (1, 'Hard Drive', Decimal('240.00'), 5, 5, 'Fujitisu'),
 (2, 'Memory', Decimal('120.00'), 6, 6, 'Winchester'),
 (4, 'Floppy disk', Decimal('5.00'), 6, 6, 'Winchester')]

In [36]:
%%sql
Alter table manufacturers 
rename column name to manufacturer_name;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [38]:
%%sql

/*
10) Select all the data from the products, including all the data for 
each product's manufacturer.
*/
Select p.*, 
m.*
from products as p
join Manufacturers as m
on p.manufacturer_code = m.code

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(5, 'Monitor', Decimal('240.00'), 1, 1, 'Sony'),
 (6, 'DVD drive', Decimal('180.00'), 2, 2, 'Creative Labs'),
 (7, 'CD drive', Decimal('90.00'), 2, 2, 'Creative Labs'),
 (10, 'DVD burner', Decimal('180.00'), 2, 2, 'Creative Labs'),
 (8, 'Printer', Decimal('270.00'), 3, 3, 'Hawlwrr-Packard'),
 (9, 'Toner cartridge', Decimal('66.00'), 3, 3, 'Hawlwrr-Packard'),
 (3, 'ZIP drive', Decimal('150.00'), 4, 4, 'Iomega'),
 (1, 'Hard Drive', Decimal('240.00'), 5, 5, 'Fujitisu'),
 (2, 'Memory', Decimal('120.00'), 6, 6, 'Winchester'),
 (4, 'Floppy disk', Decimal('5.00'), 6, 6, 'Winchester')]

In [39]:
%%sql

# 11) Select the product name, price, and manufacturer name of all the products.

Select p.name, 
p.price,
manufacturer_name
from products as p
join manufacturers as m
on p.manufacturer_code = m.code;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Monitor', Decimal('240.00'), 'Sony'),
 ('DVD drive', Decimal('180.00'), 'Creative Labs'),
 ('CD drive', Decimal('90.00'), 'Creative Labs'),
 ('DVD burner', Decimal('180.00'), 'Creative Labs'),
 ('Printer', Decimal('270.00'), 'Hawlwrr-Packard'),
 ('Toner cartridge', Decimal('66.00'), 'Hawlwrr-Packard'),
 ('ZIP drive', Decimal('150.00'), 'Iomega'),
 ('Hard Drive', Decimal('240.00'), 'Fujitisu'),
 ('Memory', Decimal('120.00'), 'Winchester'),
 ('Floppy disk', Decimal('5.00'), 'Winchester')]

In [50]:
%%sql

/*
12) Select the average price of each manufacturer's products, 
showing only the manufacturer's code.
*/

Select manufacturer_code,
Product_Avg_by_manufacturers
from ( Select m.code as "manufacturer_code",
m.manufacturer_name ,
avg(p.price) as "Product_Avg_by_manufacturers"
from  manufacturers as m
join products as p
on m.code = p.manufacturer_code
group by m.code, m.manufacturer_name ) as manu_by_avg

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, Decimal('240.000000')),
 (2, Decimal('150.000000')),
 (3, Decimal('168.000000')),
 (4, Decimal('150.000000')),
 (5, Decimal('240.000000')),
 (6, Decimal('62.500000'))]

In [51]:
%%sql

/*
13) Select the average price of each manufacturer's products, showing 
the manufacturer's name.
*/

Select m.manufacturer_name,
avg(p.price) as "price_avg_by_manufacturer"
from manufacturers as m
join products as p
on m.code = p.manufacturer_code
group by m.manufacturer_name

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[('Sony', Decimal('240.000000')),
 ('Creative Labs', Decimal('150.000000')),
 ('Hawlwrr-Packard', Decimal('168.000000')),
 ('Iomega', Decimal('150.000000')),
 ('Fujitisu', Decimal('240.000000')),
 ('Winchester', Decimal('62.500000'))]

In [56]:
%%sql

/*
14) Select the names of manufacturer whose products have an average price larger
than or equal to $150.
*/

Select m.manufacturer_name,
floor(avg(p.price))as "avg_price_product_by_manufacturer"
from manufacturers as m
join products as p
on m.code = p.manufacturer_code
group by m.manufacturer_name
having avg(p.price) >= 150;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Sony', 240),
 ('Creative Labs', 150),
 ('Hawlwrr-Packard', 168),
 ('Iomega', 150),
 ('Fujitisu', 240)]

In [62]:
%%sql

#15) Select the name and price of the cheapest product.

Select name, price as cheapest_product
from products
where price in ( 
    Select min(price) 
    from products)

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('Floppy disk', Decimal('5.00'))]

In [64]:
%%sql

/*
16)  Select the name of each manufacturer along with the name 
and price of its most expensive product.
*/

Select m.manufacturer_name,
p.name,
p.price
from manufacturers as m
join products as p
on m.code = p.manufacturer_code
where p.price in (
    Select max(price)
    from products)

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('Hawlwrr-Packard', 'Printer', Decimal('270.00'))]

In [69]:
%%sql

#17) Add a new product: Loudspeakers, $70, manufacturer 2

Insert into Products(product_code, name, price, manufacturer_code)
values(11, "Loudspeakers", 70, 2)

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [70]:
%%sql

Select *
from products;

 * mysql+mysqlconnector://root:***@localhost
11 rows affected.

[(1, 'Hard Drive', Decimal('240.00'), 5),
 (2, 'Memory', Decimal('120.00'), 6),
 (3, 'ZIP drive', Decimal('150.00'), 4),
 (4, 'Floppy disk', Decimal('5.00'), 6),
 (5, 'Monitor', Decimal('240.00'), 1),
 (6, 'DVD drive', Decimal('180.00'), 2),
 (7, 'CD drive', Decimal('90.00'), 2),
 (8, 'Printer', Decimal('270.00'), 3),
 (9, 'Toner cartridge', Decimal('66.00'), 3),
 (10, 'DVD burner', Decimal('180.00'), 2),
 (11, 'Loudspeakers', Decimal('70.00'), 2)]

In [73]:
%%sql

#18) Update the name of product 8 to "Laser Printer".

Update products
set name = "Laser Printer"
where product_code = 8;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [74]:
%%sql
Select * 
from products;

 * mysql+mysqlconnector://root:***@localhost
11 rows affected.

[(1, 'Hard Drive', Decimal('240.00'), 5),
 (2, 'Memory', Decimal('120.00'), 6),
 (3, 'ZIP drive', Decimal('150.00'), 4),
 (4, 'Floppy disk', Decimal('5.00'), 6),
 (5, 'Monitor', Decimal('240.00'), 1),
 (6, 'DVD drive', Decimal('180.00'), 2),
 (7, 'CD drive', Decimal('90.00'), 2),
 (8, 'Laser Printer', Decimal('270.00'), 3),
 (9, 'Toner cartridge', Decimal('66.00'), 3),
 (10, 'DVD burner', Decimal('180.00'), 2),
 (11, 'Loudspeakers', Decimal('70.00'), 2)]

In [88]:
%%sql


#19) Apply a 10% discount to all products.
Select product_code,
       Name, 
       Price,
       price * 0.9 as "Price (10% discount)"
from products

 * mysql+mysqlconnector://root:***@localhost
11 rows affected.

[(1, 'Hard Drive', Decimal('240.00'), Decimal('216.000')),
 (2, 'Memory', Decimal('120.00'), Decimal('108.000')),
 (3, 'ZIP drive', Decimal('150.00'), Decimal('135.000')),
 (4, 'Floppy disk', Decimal('5.00'), Decimal('4.500')),
 (5, 'Monitor', Decimal('240.00'), Decimal('216.000')),
 (6, 'DVD drive', Decimal('180.00'), Decimal('162.000')),
 (7, 'CD drive', Decimal('90.00'), Decimal('81.000')),
 (8, 'Laser Printer', Decimal('270.00'), Decimal('243.000')),
 (9, 'Toner cartridge', Decimal('66.00'), Decimal('59.400')),
 (10, 'DVD burner', Decimal('180.00'), Decimal('162.000')),
 (11, 'Loudspeakers', Decimal('70.00'), Decimal('63.000'))]

In [89]:
%%sql

#20)Apply a 10% discount to all products with a price larger than or equal to $120.

Select Name,
Price,
floor(price * 0.9) as "Price(10% discount)"
from products 
where price >= 120;

 * mysql+mysqlconnector://root:***@localhost
7 rows affected.

[('Hard Drive', Decimal('240.00'), 216),
 ('Memory', Decimal('120.00'), 108),
 ('ZIP drive', Decimal('150.00'), 135),
 ('Monitor', Decimal('240.00'), 216),
 ('DVD drive', Decimal('180.00'), 162),
 ('Laser Printer', Decimal('270.00'), 243),
 ('DVD burner', Decimal('180.00'), 162)]